app/controllers/build_controller.rb

  def build_site
    @site = Site.find(params[:id])
---
SELECT  "sites".* FROM "sites" WHERE "sites"."id" = $1 LIMIT 1  [["id", 3]]

  def show_json
    @site = Site.find(params[:id])
---
SELECT  "sites".* FROM "sites" WHERE "sites"."id" = $1 LIMIT 1  [["id", nil]]