app/controllers/gallery_pictures_controller.rb

  def index
    @gallery_pictures = GalleryPicture.where(site_id: params[:site_id])
    @site = Site.find(params[:site_id])
---
SELECT "gallery_pictures".* FROM "gallery_pictures" WHERE "gallery_pictures"."site_id" = $1  [["site_id", 10]]
SELECT  "sites".* FROM "sites" WHERE "sites"."id" = $1 LIMIT 1  [["id", 10]]

  def render_json
    @gallery_pictures = GalleryPicture.where(site_id: params[:id])
---
SELECT "gallery_pictures".* FROM "gallery_pictures" WHERE "gallery_pictures"."site_id" = $1  [["site_id", 1]]

  def new
    @site = Site.find(params[:site_id])
---
SELECT  "sites".* FROM "sites" WHERE "sites"."id" = $1 LIMIT 1  [["id", 10]]

  def create
    @site = Site.find(params[:site_id])
    @gallery_picture = @site.gallery_pictures.new(create_gallery_picture_params[:gallery_picture])
    if(@gallery_picture.save)
---
SELECT  "sites".* FROM "sites" WHERE "sites"."id" = $1 LIMIT 1  [["id", 10]]
INSERT INTO "gallery_pictures" ("site_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["site_id", 10], ["created_at", "2016-08-15 19:55:48.064774"], ["updated_at", "2016-08-15 19:55:48.064774"]]

  def edit
    @gallery_picture = GalleryPicture.find(params[:id])
    @site = Site.find(params[:site_id])
---
SELECT  "gallery_pictures".* FROM "gallery_pictures" WHERE "gallery_pictures"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "sites".* FROM "sites" WHERE "sites"."id" = $1 LIMIT 1  [["id", 10]]

  def update
    @gallery_picture = GalleryPicture.find(params[:id])
---
SELECT  "gallery_pictures".* FROM "gallery_pictures" WHERE "gallery_pictures"."id" = $1 LIMIT 1  [["id", 4]]

  def destroy
    @gallery_picture = GalleryPicture.find(params[:id])
    # @site = Site.find(params[:site_id])
    @gallery_picture.destroy
---
SELECT  "gallery_pictures".* FROM "gallery_pictures" WHERE "gallery_pictures"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "gallery_pictures" WHERE "gallery_pictures"."id" = $1  [["id", 1]]