app/controllers/sessions_controller.rb

  def create
    #accepts OAuth information from Google, finds or creates a User account, and sets user_id in session
    auth_hash = request.env['omniauth.auth']   #request is a variable that you get
    @user = User.find_or_create_from_omniauth(auth_hash)
---
INSERT INTO "users" ("uid", "provider", "first_name", "image", "url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"