app/controllers/sites_controller.rb

INSERT INTO "sites" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Ahora si"], ["description", "Agarrense que ahi les voy!"], ["created_at", "2016-08-12 21:04:38.459167"], ["updated_at", "2016-08-12 21:04:38.459167"]]
---
  def create
    @site = Site.new(create_site_params[:site])
    if(@site.save)

SELECT  "sites".* FROM "sites" WHERE "sites"."user_id" = $1 AND "sites"."id" = $2 LIMIT 1  [["user_id", 1], ["id", 7]]
---
  def edit
    @site = current_user.sites.find(params[:id])

SELECT  "sites".* FROM "sites" WHERE "sites"."user_id" = $1 AND "sites"."id" = $2 LIMIT 1  [["user_id", 1], ["id", 8]]
UPDATE "sites" SET "title" = $1, "updated_at" = $2 WHERE "sites"."id" = $3  [["title", "Paginas Bien"], ["updated_at", "2016-08-12 22:52:51.401321"], ["id", 7]]
---
  def update
    @site = current_user.sites.find(params[:id])
    @site.update(site_update_params[:site])

SELECT  "sites".* FROM "sites" WHERE "sites"."user_id" = $1 AND "sites"."id" = $2 LIMIT 1  [["user_id", 1], ["id", 9]]
---
  def edit_additional_info
    @site = current_user.sites.find(params[:id])

SELECT  "sites".* FROM "sites" WHERE "sites"."user_id" = $1 AND "sites"."id" = $2 LIMIT 1  [["user_id", 1], ["id", 9]]
UPDATE "sites" SET "hero_title" = $1, "hero_description" = $2, "phone" = $3, "emergency" = $4, "email" = $5, "address" = $6, "updated_at" = $7 WHERE "sites"."id" = $8  [["hero_title", "SI!!"], ["hero_description", ""], ["phone", ""], ["emergency", ""], ["email", ""], ["address", ""], ["updated_at", "2016-08-15 17:21:57.977309"], ["id", 9]]
---
  def update_additional_info
    @site = current_user.sites.find(params[:id])
    @site.update(site_additional_params[:site])

SELECT  "sites".* FROM "sites" WHERE "sites"."user_id" = $1 AND "sites"."id" = $2 LIMIT 1  [["user_id", 1], ["id", 6]]
DELETE FROM "sites" WHERE "sites"."id" = $1  [["id", 6]]
---
  def destroy
    @site = current_user.sites.find(params[:id])
    @site.destroy