app/controllers/team_members_controller.rb

  def index
    @team_members = TeamMember.where(site_id: params[:site_id])
    @site = Site.find(params[:site_id])
---
SELECT "team_members".* FROM "team_members" WHERE "team_members"."site_id" = $1  [["site_id", 8]]
SELECT  "sites".* FROM "sites" WHERE "sites"."id" = $1 LIMIT 1  [["id", 8]]

  def render_json
    @team_members = TeamMember.where(site_id: params[:id])
---
SELECT "team_members".* FROM "team_members" WHERE "team_members"."site_id" = $1  [["site_id", 1]]

  def new
    @site = Site.find(params[:site_id])
---
SELECT  "sites".* FROM "sites" WHERE "sites"."id" = $1 LIMIT 1  [["id", 7]]

  def create
    @site = Site.find(params[:site_id])
    @team_member = @site.team_members.new(create_team_member_params[:team_member])
    if(@team_member.save)
---
SELECT  "sites".* FROM "sites" WHERE "sites"."id" = $1 LIMIT 1  [["id", 7]]
INSERT INTO "team_members" ("name", "email", "phone", "site_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Ricardo Lechuga"], ["email", "super@lechuga"], ["phone", ""], ["site_id", 7], ["created_at", "2016-08-17 18:15:06.643916"], ["updated_at", "2016-08-17 18:15:06.643916"]]

  def edit
    @team_member = TeamMember.find(params[:id])
    @site = Site.find(params[:site_id])
---
SELECT  "team_members".* FROM "team_members" WHERE "team_members"."id" = $1 LIMIT 1  [["id", nil]]
SELECT  "sites".* FROM "sites" WHERE "sites"."id" = $1 LIMIT 1  [["id", 10]]

  def update
    @team_member = TeamMember.find(params[:id])
    @team_member.update(team_member_update_params[:team_member])
---
SELECT  "team_members".* FROM "team_members" WHERE "team_members"."id" = $1 LIMIT 1  [["id", 6]]
UPDATE "team_members" SET "phone" = $1, "updated_at" = $2 WHERE "team_members"."id" = $3  [["phone", "777"], ["updated_at", "2016-08-15 18:20:30.057608"], ["id", 6]]

  def destroy
    @team_member = TeamMember.find(params[:id])
    # @site = Site.find(params[:site_id])
    @team_member.destroy
---
SELECT  "team_members".* FROM "team_members" WHERE "team_members"."id" = $1 LIMIT 1  [["id", 9]]
DELETE FROM "team_members" WHERE "team_members"."id" = $1  [["id", 9]]