app/controllers/testimonials_controller.rb

SELECT "testimonials".* FROM "testimonials" WHERE "testimonials"."site_id" = $1  [["site_id", 8]]
SELECT  "sites".* FROM "sites" WHERE "sites"."id" = $1 LIMIT 1  [["id", 8]]
---
    def index
      @testimonials = Testimonial.where(site_id: params[:site_id])
      @site = Site.find(params[:site_id])

SELECT "testimonials".* FROM "testimonials" WHERE "testimonials"."site_id" = $1  [["site_id", 1]]
---
    def render_json
      @testimonials = Testimonial.where(site_id: params[:id])

SELECT  "sites".* FROM "sites" WHERE "sites"."id" = $1 LIMIT 1  [["id", 8]]
---
    def new
      @site = Site.find(params[:site_id])

SELECT  "sites".* FROM "sites" WHERE "sites"."id" = $1 LIMIT 1  [["id", 8]]
INSERT INTO "testimonials" ("name", "description", "title", "site_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Anahi"], ["description", "Padrisimo servicio!"], ["title", "Secretaria"], ["site_id", 8], ["created_at", "2016-08-15 19:46:22.956490"], ["updated_at", "2016-08-15 19:46:22.956490"]]
---
    def create
      @site = Site.find(params[:site_id])
      @testimonial = @site.testimonials.new(create_testimonial_params[:testimonial])
      if(@testimonial.save)

SELECT  "testimonials".* FROM "testimonials" WHERE "testimonials"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "sites".* FROM "sites" WHERE "sites"."id" = $1 LIMIT 1  [["id", 8]]
---
    def edit
      @testimonial = Testimonial.find(params[:id])
      @site = Site.find(params[:site_id])

SELECT  "testimonials".* FROM "testimonials" WHERE "testimonials"."id" = $1 LIMIT 1  [["id", 2]]
---
    def update
      @testimonial = Testimonial.find(params[:id])