app/controllers/treatments_controller.rb

  def index
    @treatments = Treatment.where(site_id: params[:site_id])
    @site = Site.find(params[:site_id])
---
SELECT "treatments".* FROM "treatments" WHERE "treatments"."site_id" = $1  [["site_id", 8]]
SELECT  "sites".* FROM "sites" WHERE "sites"."id" = $1 LIMIT 1  [["id", 8]]

  def render_json
    @treatments = Treatment.where(site_id: params[:id])
---
SELECT "treatments".* FROM "treatments" WHERE "treatments"."site_id" = $1  [["site_id", 1]]

  def new
    @site = Site.find(params[:site_id])
---
SELECT  "sites".* FROM "sites" WHERE "sites"."id" = $1 LIMIT 1  [["id", 8]]

  def create
    @site = Site.find(params[:site_id])
    @treatment = @site.treatments.new(create_treatment_params[:treatment])
    if(@treatment.save)
---
SELECT  "sites".* FROM "sites" WHERE "sites"."id" = $1 LIMIT 1  [["id", 8]]
INSERT INTO "treatments" ("icon", "title", "description", "site_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["icon", ""], ["title", "Limpieza anticarie"], ["description", ""], ["site_id", 8], ["created_at", "2016-08-15 18:39:06.611331"], ["updated_at", "2016-08-15 18:39:06.611331"]]

  def edit
    @treatment = Treatment.find(params[:id])
    @site = Site.find(params[:site_id])
---
SELECT  "treatments".* FROM "treatments" WHERE "treatments"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "sites".* FROM "sites" WHERE "sites"."id" = $1 LIMIT 1  [["id", 8]]

  def update
    @treatment = Treatment.find(params[:id])
---
SELECT  "treatments".* FROM "treatments" WHERE "treatments"."id" = $1 LIMIT 1  [["id", 1]]

  def destroy
    @treatment = Treatment.find(params[:id])
    # @site = Site.find(params[:site_id])
    @treatment.destroy
---
SELECT  "treatments".* FROM "treatments" WHERE "treatments"."id" = $1 LIMIT 1  [["id", 2]]
DELETE FROM "treatments" WHERE "treatments"."id" = $1  [["id", 2]]